[
  {
    "role": "Data Scientist",
    "organisation": "Technet.ai",
    "startDate": "July, 2024",
    "endDate": "Present",
    "experiences": [
      "Boosted sales forecast accuracy by 25% by developing self-learning AI/ML models for product demand prediction, directly enhancing marketing strategies and financial planning.",
      "Accelerated model deployment by 40% through building scalable ML pipelines using TensorFlow, PyTorch, and Kubernetes, reducing time-to-market for new insights. ","Improved revenue-generating decision-making by delivering predictive analytics across customer behavior and sales trends."
    ],
    "imageSrc": "history/technet-logo.svg"
  },
  {
    "role": "Research Analyst",
    "organisation": "Human Factors Lab | NSF",
    "startDate": "Aug, 2022",
    "endDate": "May, 2024",
    "experiences": [
      "Developed a real-time analytics platform to detect fatigue in industrial environments, reducing assessment time by 40% using Django/React and Microsoft AR motion tracking.",
      "Designed an ML model scoring system (0–100) to quantify user fatigue with 80% precision, integrating multi-sensor inputs for AR scene transitions.",
      "Built and orchestrated an ETL pipeline in PostgreSQL & Python, processing 500K+ data points per session, reducing latency by 40% and improving ML model training efficiency."
    ],
    "imageSrc": "history/mu.png"
  },
  {
    "role": "Data Analyst",
    "organisation": "Accenture Solutions | CVS Health",
    "startDate": "Aug, 2020",
    "endDate": "Dec, 2021",
    "experiences": [
      "Enhanced patient care decision-making by identifying high-risk claims using Python-driven outlier fraud detection, improving early intervention by 20% on 500K+ healthcare claim records.",
      "Integrated ML model predictions into strategic decision-making processes, achieving a 15% improvement in operational accuracy and significantly enhancing resource utilization.",
      "Built SQL pipelines, interactive Power BI dashboards, and implemented data warehousing solutions using AWS services."
    ],
    "imageSrc": "history/Accenture.png"
  }
]
